app/controllers/articlees_controller.rb

SELECT `articlees`.* FROM `articlees`
---
    def index
        @articlees = Articlee.all

SELECT `articlees`.* FROM `articlees` WHERE `articlees`.`id` = 2 LIMIT 1
---
    def edit
        @articlee = Articlee.find(params[:id])

SELECT `articlees`.* FROM `articlees` WHERE `articlees`.`id` = 2 LIMIT 1
UPDATE `articlees` SET `articlees`.`title` = 'Second articless', `articlees`.`description` = 'Description of second article sss', `articlees`.`updated_at` = '2023-01-24 07:12:01.837996' WHERE `articlees`.`id` = 2
---
    def update
        @articlee = Articlee.find(params[:id])
        if @articlee.update(params.require(:articlee).permit(:title, :description))

SELECT `articlees`.* FROM `articlees`
SELECT `users`.* FROM `users` ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `articlees` (`title`, `description`, `user_id`, `created_at`, `updated_at`) VALUES ('Title Articlee', '1.The Title is about the new description\r\n2.Ukraine war is the best way', 1, '2023-02-10 11:51:42.483167', '2023-02-10 11:51:42.483167')
---
    def create
        # render plain: params[:articlee]
        @articlee = Articlee.new(params.require(:articlee).permit(:title ,:description))
        @articlee.user = User.first
        # @articlee.save
        # redirect_to @articlee
        # render plain: @articlee
        # byebug
        if @articlee.save

SELECT `articlees`.* FROM `articlees` WHERE `articlees`.`id` = 4 LIMIT 1
---
    def show
        @articlee = Articlee.find(params[:id])

SELECT `articlees`.* FROM `articlees` WHERE `articlees`.`id` = 2 LIMIT 1
DELETE FROM `articlees` WHERE `articlees`.`id` = 9
---
    def destroy
        @articlee = Articlee.find(params[:id])
        @articlee.destroy

SELECT `articlees`.* FROM `articlees` WHERE `articlees`.`id` = 1 LIMIT 1
---
    def show_post
        @articlee = Articlee.find(params[:id])