app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 11 LIMIT 1
---
    def show
        @post = Post.find(
        params[:id]
        )

SELECT `posts`.* FROM `posts`
---
    def index
    @posts = Post.all

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
---
    def edit
        @post =Post.find(
        params[:id]
        )

INSERT INTO `posts` (`name`, `articlee_id`, `created_at`, `updated_at`) VALUES ('hggjhgjhg', '4', '2023-02-01 12:43:38.736349', '2023-02-01 12:43:38.736349')
---
    def create
        @post = Post.new(params[:post].permit(:name, :articlee_id))
        if @post.save

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
UPDATE `posts` SET `posts`.`name` = 'Awesome postss', `posts`.`updated_at` = '2023-02-09 10:16:38.871077' WHERE `posts`.`id` = 1
---
    def update
        @post = Post.find(params[:id])
        if @post.update(params.require(:post).permit(:name ))

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 10 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 10
---
    def destroy
        @post = Post.find(params[:id])
        @post.destroy