app/controllers/users_controller.rb

INSERT INTO `users` (`username`, `email`, `created_at`, `updated_at`, `password_digest`) VALUES ('himanshu gupta', 'himanshu.gupta2@w3villa.com', '2023-02-11 13:28:17.697276', '2023-02-11 13:28:17.697276', '$2a$12$a0deEPH2d2vJg6bN2o./LOti/UmkACKG06uOFjHs8kKoLi4YMGAje')
---
    def create
        @user = User.new(user_params)
        if @user.save